TexasInstruments/open-pru/examples/pru_i2s/pru_i2s_app/am261x-lp/r5fss0-0_freertos/example.syscfg
section11.$name                       = "CONFIG_SECTION0";
section11.group                       = false;
section11.load_memory                 = "OCRAM_256K3_RAM";
section11.output_section.create(1);
section11.output_section[0].$name     = ".PruI2s1RxPingPongBuf";
section11.output_section[0].alignment = 0;

section12.$name                       = "CONFIG_SECTION1";
section12.group                       = false;
section12.load_memory                 = "OCRAM_256K4_RAM";
section12.output_section.create(1);
section12.output_section[0].$name     = ".TxBuf";
section12.output_section[0].fill      = 2863329520;
section12.output_section[0].alignment = 0;

section13.$name                        = "CONFIG_SECTION2";
section13.group                        = false;
section13.load_memory                  = "OCRAM_256K4_RAM";
section13.output_section.create(1);
section13.output_section[0].fill       = 1431655765;
section13.output_section[0].$name      = ".RxBuf";
section13.output_section[0].macro_name = "RXBUF_SECTION";
section13.output_section[0].alignment  = 0;

/**
 * Pinmux solution for unlocked pins/peripherals. This ensures that minor changes to the automatic solver in a future
 * version of the tool will not impact the pinmux you originally saw.  These lines can be completely deleted in order to
 * re-solve from scratch.
 */
gpio1.GPIO_n.$suggestSolution                                                               = "GPIO0";
i2c1.I2C.SCL.$suggestSolution                                                               = "GPIO135";
i2c1.I2C.SDA.$suggestSolution                                                               = "GPIO134";
pruicss1.AdditionalICSSSettings[0].PruGPIO[0]["PRU-ICSS1"].$suggestSolution                 = "PRU-ICSS1";
pruicss1.AdditionalICSSSettings[0].PruGPIO[0]["PRU-ICSS1"].PR1_PRU1_GPIO5.$suggestSolution  = "GPIO54";
pruicss1.AdditionalICSSSettings[0].PruGPIO[0]["PRU-ICSS1"].PR1_PRU0_GPIO9.$suggestSolution  = "GPIO12";
pruicss1.AdditionalICSSSettings[0].PruGPIO[0]["PRU-ICSS1"].PR1_PRU1_GPIO12.$suggestSolution = "GPIO4";
pruicss1.AdditionalICSSSettings[0].PruGPIO[0]["PRU-ICSS1"].PR1_PRU1_GPIO9.$suggestSolution  = "GPIO74";
pruicss1.AdditionalICSSSettings[0].PruGPIO[0]["PRU-ICSS1"].PR1_PRU0_GPIO7.$suggestSolution  = "GPIO122";
pruicss1.AdditionalICSSSettings[0].PruGPIO[0]["PRU-ICSS1"].PR1_PRU1_GPIO13.$suggestSolution = "GPIO125";
pruicss1.AdditionalICSSSettings[0].PruGPIO[0]["PRU-ICSS1"].PR1_PRU0_GPIO5.$suggestSolution  = "GPIO43";
pruicss1.AdditionalICSSSettings[0].PruGPIO[0]["PRU-ICSS1"].PR1_PRU0_GPIO8.$suggestSolution  = "GPIO44";
pruicss1.AdditionalICSSSettings[0].PruGPIO[0]["PRU-ICSS1"].PR1_PRU0_GPIO6.$suggestSolution  = "GPIO45";
pruicss1.intcMapping.create(6);
pruicss1.intcMapping[0].$name   = "CONFIG_PRU_I2S_PRU0_TX";
pruicss1.intcMapping[0].event   = "18";
pruicss1.intcMapping[0].channel = "2";
pruicss1.intcMapping[1].$name   = "CONFIG_PRU_I2S_PRU0_RX";
pruicss1.intcMapping[1].event   = "19";
pruicss1.intcMapping[1].channel = "3";
pruicss1.intcMapping[2].$name   = "CONFIG_PRU_I2S_PRU0_ERR";
pruicss1.intcMapping[2].event   = "20";
pruicss1.intcMapping[2].channel = "4";
pruicss1.intcMapping[3].$name   = "CONFIG_PRU_I2S_PRU1_TX";
pruicss1.intcMapping[3].event   = "21";
pruicss1.intcMapping[3].channel = "5";
pruicss1.intcMapping[4].$name   = "CONFIG_PRU_I2S_PRU1_RX";
pruicss1.intcMapping[4].event   = "22";
pruicss1.intcMapping[4].channel = "6";
pruicss1.intcMapping[5].$name   = "CONFIG_PRU_I2S_PRU1_ERR";
pruicss1.intcMapping[5].event   = "23";
pruicss1.intcMapping[5].channel = "7";
